#!/usr/bin/python3
# -*- coding: utf-8 -*-
# @Time    : 2018/6/7 20:04
# @Author  : @乌鸦坐飞机
# Description   : 颜色高亮
import random
#高亮显示 红黑
'''
字背景颜色范围: 40--49                   字颜色: 30--39  
        40: 黑                         30: 黑  
        41:红                          31: 红  
        42:绿                          32: 绿  
        43:黄                          33: 黄  
        44:蓝                          34: 蓝  
        45:紫                          35: 紫  
        46:深绿                        36: 深绿  
        47:白色                        37: 白色  
'''
print('\033[5;31;40m输入错误!\033[0m')
for i in range(30,38):
    for j in range(40,50):
        print('字的颜色[%d:],背景颜色[%d:]'%(i,j),'\033[5;%s;%smHELLO\033[0m'%(i,j))


